report/stage_4/profiling/three_nodes/md5/wrk2_sharding_md5_put.txt
$ wrk2 -c 128 -t 8 -d 125s -R 50000 -L -s ./scripts/put.lua http://localhost:8080/ >> output/wrk2_sharding_put.txt


Running 2m test @ http://localhost:8080/
  8 threads and 128 connections
  Thread calibration: mean lat.: 4.231ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 6.529ms, rate sampling interval: 11ms
  Thread calibration: mean lat.: 6.677ms, rate sampling interval: 13ms
  Thread calibration: mean lat.: 5.539ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 6.279ms, rate sampling interval: 11ms
  Thread calibration: mean lat.: 5.212ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 5.958ms, rate sampling interval: 12ms
  Thread calibration: mean lat.: 3.429ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    28.82ms   79.36ms   1.10s    91.93%
    Req/Sec     6.57k     1.01k   27.64k    78.64%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.62ms
 75.000%    7.57ms
 90.000%   88.57ms
 99.000%  421.89ms
 99.900%  713.73ms
 99.990%    1.01s 
 99.999%    1.09s 
100.000%    1.10s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.026     0.000000            2         1.00
       0.584     0.100000       575096         1.11
       0.848     0.200000      1149674         1.25
       1.083     0.300000      1724471         1.43
       1.325     0.400000      2298258         1.67
       1.618     0.500000      2872513         2.00
       1.810     0.550000      3160163         2.22
       2.067     0.600000      3447440         2.50
       2.469     0.650000      3734246         2.86
       3.355     0.700000      4021509         3.33
       7.571     0.750000      4308496         4.00
      13.975     0.775000      4452217         4.44
      23.215     0.800000      4595819         5.00
      35.327     0.825000      4739382         5.71
      49.567     0.850000      4883059         6.67
      67.007     0.875000      5026950         8.00
      77.119     0.887500      5098750         8.89
      88.575     0.900000      5170432        10.00
     100.863     0.912500      5242166        11.43
     115.199     0.925000      5313961        13.33
     135.039     0.937500      5385862        16.00
     147.455     0.943750      5421741        17.78
     161.919     0.950000      5457473        20.00
     180.095     0.956250      5493553        22.86
     205.567     0.962500      5529301        26.67
     236.415     0.968750      5565243        32.00
     253.055     0.971875      5583123        35.56
     271.359     0.975000      5601035        40.00
     293.375     0.978125      5619109        45.71
     320.511     0.981250      5636956        53.33
     351.231     0.984375      5654933        64.00
     367.871     0.985938      5663904        71.11
     386.559     0.987500      5672917        80.00
     406.783     0.989062      5681852        91.43
     432.383     0.990625      5690844       106.67
     461.311     0.992188      5699827       128.00
     478.463     0.992969      5704252       142.22
     498.175     0.993750      5708764       160.00
     517.631     0.994531      5713235       182.86
     538.111     0.995313      5717758       213.33
     560.127     0.996094      5722218       256.00
     573.439     0.996484      5724477       284.44
     586.751     0.996875      5726720       320.00
     603.647     0.997266      5728945       365.71
     621.055     0.997656      5731192       426.67
     644.095     0.998047      5733430       512.00
     656.895     0.998242      5734551       568.89
     671.231     0.998437      5735681       640.00
     685.567     0.998633      5736816       731.43
     697.343     0.998828      5737947       853.33
     716.287     0.999023      5739039      1024.00
     727.551     0.999121      5739608      1137.78
     737.791     0.999219      5740158      1280.00
     748.543     0.999316      5740732      1462.86
     762.879     0.999414      5741282      1706.67
     782.335     0.999512      5741843      2048.00
     790.015     0.999561      5742121      2275.56
     800.767     0.999609      5742400      2560.00
     814.591     0.999658      5742676      2925.71
     825.855     0.999707      5742964      3413.33
     845.823     0.999756      5743236      4096.00
     866.815     0.999780      5743375      4551.11
     889.855     0.999805      5743516      5120.00
     907.775     0.999829      5743659      5851.43
     933.375     0.999854      5743797      6826.67
     972.287     0.999878      5743936      8192.00
     990.719     0.999890      5744007      9102.22
    1009.151     0.999902      5744077     10240.00
    1016.319     0.999915      5744147     11702.86
    1020.415     0.999927      5744220     13653.33
    1026.047     0.999939      5744294     16384.00
    1028.095     0.999945      5744326     18204.44
    1032.703     0.999951      5744360     20480.00
    1036.287     0.999957      5744394     23405.71
    1038.847     0.999963      5744427     27306.67
    1051.647     0.999969      5744462     32768.00
    1063.935     0.999973      5744481     36408.89
    1073.151     0.999976      5744500     40960.00
    1081.343     0.999979      5744521     46811.43
    1084.415     0.999982      5744534     54613.33
    1087.487     0.999985      5744561     65536.00
    1087.487     0.999986      5744561     72817.78
    1088.511     0.999988      5744570     81920.00
    1093.631     0.999989      5744577     93622.86
    1094.655     0.999991      5744585    109226.67
    1095.679     0.999992      5744598    131072.00
    1095.679     0.999993      5744598    145635.56
    1097.727     0.999994      5744607    163840.00
    1097.727     0.999995      5744607    187245.71
    1098.751     0.999995      5744611    218453.33
    1099.775     0.999996      5744627    262144.00
    1099.775     0.999997      5744627    291271.11
    1099.775     0.999997      5744627    327680.00
    1099.775     0.999997      5744627    374491.43
    1099.775     0.999998      5744627    436906.67
    1099.775     0.999998      5744627    524288.00
    1100.799     0.999998      5744635    582542.22
    1100.799     0.999998      5744635    655360.00
    1100.799     0.999999      5744635    748982.86
    1100.799     0.999999      5744635    873813.33
    1100.799     0.999999      5744635   1048576.00
    1100.799     0.999999      5744635   1165084.44
    1100.799     0.999999      5744635   1310720.00
    1100.799     0.999999      5744635   1497965.71
    1100.799     0.999999      5744635   1747626.67
    1100.799     1.000000      5744635   2097152.00
    1100.799     1.000000      5744635   2330168.89
    1100.799     1.000000      5744635   2621440.00
    1101.823     1.000000      5744636   2995931.43
    1101.823     1.000000      5744636   3495253.33
    1101.823     1.000000      5744636   4194304.00
    1101.823     1.000000      5744636   4660337.78
    1101.823     1.000000      5744636   5242880.00
    1102.847     1.000000      5744637   5991862.86
    1102.847     1.000000      5744637          inf
#[Mean    =       28.819, StdDeviation   =       79.359]
#[Max     =     1101.824, Total count    =      5744637]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  6246348 requests in 2.08m, 501.56MB read
Requests/sec:  49971.45
Transfer/sec:      4.01MB